In [41]:
import pandas as pd
import numpy as np

In [42]:
# 1번
df = pd.read_excel('excel_exam.xlsx')

In [43]:
# 2번
df = pd.read_excel('excel_exam.xlsx', header = None)

In [44]:
# 3번
df.head(5)

    0       1     2        3        4
0  id  nclass  math  english  science
1   1       1    50       98       50
2   2       1    60       97       60
3   3       1    45       86       78
4   4       1    30       98       58

In [45]:
# 4번
df.shape

(21, 5)

In [46]:
# 5번
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       21 non-null     object
 1   1       21 non-null     object
 2   2       21 non-null     object
 3   3       21 non-null     object
 4   4       21 non-null     object
dtypes: object(5)
memory usage: 968.0+ bytes

In [47]:
# 6번
df.describe()

         0   1   2   3   4
count   21  21  21  21  21
unique  21   6  16  14  14
top     id   1  50  98  65
freq     1   4   3   6   4

In [48]:
df['test'] = 1

In [49]:
df.head()

    0       1     2        3        4  test
0  id  nclass  math  english  science     1
1   1       1    50       98       50     1
2   2       1    60       97       60     1
3   3       1    45       86       78     1
4   4       1    30       98       58     1

In [50]:
# 7번
df.describe(include = 'all')

          0     1     2     3     4  test
count    21  21.0  21.0  21.0  21.0  21.0
unique   21   6.0  16.0  14.0  14.0   NaN
top      id   1.0  50.0  98.0  65.0   NaN
freq      1   4.0   3.0   6.0   4.0   NaN
mean    NaN   NaN   NaN   NaN   NaN   1.0
std     NaN   NaN   NaN   NaN   NaN   0.0
min     NaN   NaN   NaN   NaN   NaN   1.0
25%     NaN   NaN   NaN   NaN   NaN   1.0
50%     NaN   NaN   NaN   NaN   NaN   1.0
75%     NaN   NaN   NaN   NaN   NaN   1.0
max     NaN   NaN   NaN   NaN   NaN   1.0

In [ ]:
# 8번
df_new = df.copy()

In [ ]:
# 9번
df = df.rename(columns = {'v1' : 'v2'})

In [ ]:
# 10번
df['v3'] = df['v1'] + df['v2']

In [ ]:
# 11번
df['v3'] = np.where(df['v1'] >= 20, 'pass', 'fail')

In [ ]:
# 12번
df.query('v1 == 1')

In [ ]:
# 13번
df.query('v1 == 1 | v2 == 2')

In [ ]:
# 14번
df.query('v1 in [1, 3, 5]')

In [ ]:
# 15번
df.query('v1 >= 5')[['v2', 'v3']].head()

In [ ]:
# 16번
df.sort_values('v1', ascending = False)

In [ ]:
# 17번
df.groupby('v1')\
    .agg(mean_v2 = ('v2','mean'))

In [ ]:
# 18번
df_new = pd.concat([df1,df2])

In [ ]:
# 19번
pd.isna(df).sum()

In [ ]:
# 20번
df.drop(subset = ['v1'])

In [ ]:
# 21번
df['v1'] = df['v1'].fillna(55)

In [ ]:
# 22번
df['v1'] = np.where(df['v1'] == 3, np.nan, df['v1'])

In [51]:
import pandas as pd
mpg = pd.read_csv('mpg.csv')

In [52]:
# Q1
mpg.groupby('category').agg(mean_cty = ('cty','mean'))

             mean_cty
category
2seater     15.400000
compact     20.127660
midsize     18.756098
minivan     15.818182
pickup      13.000000
subcompact  20.371429
suv         13.500000

In [53]:
# Q2 하나는 아예 없이 낸다.
mpg.groupby('category')\
    .agg(mean_cty = ('cty','mean'))\
    .sort_values('mean_cty', ascending = False)\
    .head(3)

             mean_cty
category
subcompact  20.371429
compact     20.127660
midsize     18.756098

In [54]:
import pandas as pd
import numpy as np
midwest = pd.read_csv('midwest.csv')

In [56]:
# Q1
midwest['ratio'] = (midwest['poptotal'] - midwest['popadults']) / midwest['poptotal'] * 100
midwest.head()

,PID,county,state,area,poptotal,popdensity,popwhite,popblack,popamerindian,popasian,...,percprof,poppovertyknown,percpovertyknown,percbelowpoverty,percchildbelowpovert,percadultpoverty,percelderlypoverty,inmetro,category,ratio
0,561,ADAMS,IL,0.052,66090,1270.961540,63917,1702,98,249,...,4.355859,63628,96.274777,13.151443,18.011717,11.009776,12.443812,0,AAR,34.486307
1,562,ALEXANDER,IL,0.014,10626,759.000000,7054,3496,19,48,...,2.870315,10529,99.087145,32.244278,45.826514,27.385647,25.228976,0,LHR,36.721250
2,563,BOND,IL,0.022,14991,681.409091,14477,429,35,16,...,4.488572,14235,94.956974,12.068844,14.036061,10.852090,12.697410,0,AAR,35.501301
3,564,BOONE,IL,0.017,30806,1812.117650,29344,127,46,150,...,4.197800,30337,98.477569,7.209019,11.179536,5.536013,6.217047,1,ALU,37.440758
4,565,BROWN,IL,0.018,5836,324.222222,5264,547,14,5,...,3.367680,4815,82.505140,13.520249,13.022889,11.143211,19.200000,0,AAR,31.819740

In [59]:
# Q2
midwest['grade'] = np.where(midwest['ratio'] >= 40, 'large',
                    np.where(midwest['ratio'] >= 30, 'middle', 'small'))
midwest['grade'].head()

0    middle
1    middle
2    middle
3    middle
4    middle
Name: grade, dtype: object

In [60]:
# Q3
midwest.groupby('grade')\
    .agg(count_grade = ('grade','count'))

        count_grade
grade
large            32
middle          396
small             9